zx568073531/stm32f429_pjsip/Middlewares/CycloneTCP_SSL_SSH_CRYPTO_Open_2_1_4/third_party/infineon/boards/kit_a2g_tc397_tft/intids_tc39xb.h
#define SRC_ID_SDMMCERR			348	/* SDMMC Error Service Request */
#define SRC_ID_SDMMCDMA			349	/* SDMMC DMA Ready Service Request */

#define SRC_ID_GETH0			352	/* GETH Service Request 0 */
#define SRC_ID_GETH1			353	/* GETH Service Request 1 */
#define SRC_ID_GETH2			354	/* GETH Service Request 2 */
#define SRC_ID_GETH3			355	/* GETH Service Request 3 */
#define SRC_ID_GETH4			356	/* GETH Service Request 4 */
#define SRC_ID_GETH5			357	/* GETH Service Request 5 */
#define SRC_ID_GETH6			358	/* GETH Service Request 6 */
#define SRC_ID_GETH7			359	/* GETH Service Request 7 */
#define SRC_ID_GETH8			360	/* GETH Service Request 8 */
#define SRC_ID_GETH9			361	/* GETH Service Request 9 */

#define SRC_ID_CAN0INT0			364	/* CAN0 Service Request 0 */
#define SRC_ID_CAN0INT1			365	/* CAN0 Service Request 1 */
#define SRC_ID_CAN0INT2			366	/* CAN0 Service Request 2 */
#define SRC_ID_CAN0INT3			367	/* CAN0 Service Request 3 */
#define SRC_ID_CAN0INT4			368	/* CAN0 Service Request 4 */
#define SRC_ID_CAN0INT5			369	/* CAN0 Service Request 5 */
#define SRC_ID_CAN0INT6			370	/* CAN0 Service Request 6 */
#define SRC_ID_CAN0INT7			371	/* CAN0 Service Request 7 */
#define SRC_ID_CAN0INT8			372	/* CAN0 Service Request 8 */
#define SRC_ID_CAN0INT9			373	/* CAN0 Service Request 9 */
#define SRC_ID_CAN0INT10		374	/* CAN0 Service Request 10 */
#define SRC_ID_CAN0INT11		375	/* CAN0 Service Request 11 */
#define SRC_ID_CAN0INT12		376	/* CAN0 Service Request 12 */
#define SRC_ID_CAN0INT13		377	/* CAN0 Service Request 13 */
#define SRC_ID_CAN0INT14		378	/* CAN0 Service Request 14 */
#define SRC_ID_CAN0INT15		379	/* CAN0 Service Request 15 */
#define SRC_ID_CAN1INT0			380	/* CAN1 Service Request 0 */
#define SRC_ID_CAN1INT1			381	/* CAN1 Service Request 1 */
#define SRC_ID_CAN1INT2			382	/* CAN1 Service Request 2 */
#define SRC_ID_CAN1INT3			383	/* CAN1 Service Request 3 */
#define SRC_ID_CAN1INT4			384	/* CAN1 Service Request 4 */
#define SRC_ID_CAN1INT5			385	/* CAN1 Service Request 5 */
#define SRC_ID_CAN1INT6			386	/* CAN1 Service Request 6 */
#define SRC_ID_CAN1INT7			387	/* CAN1 Service Request 7 */
#define SRC_ID_CAN1INT8			388	/* CAN1 Service Request 8 */
#define SRC_ID_CAN1INT9			389	/* CAN1 Service Request 9 */
#define SRC_ID_CAN1INT10		390	/* CAN1 Service Request 10 */
#define SRC_ID_CAN1INT11		391	/* CAN1 Service Request 11 */
#define SRC_ID_CAN1INT12		392	/* CAN1 Service Request 12 */
#define SRC_ID_CAN1INT13		393	/* CAN1 Service Request 13 */
#define SRC_ID_CAN1INT14		394	/* CAN1 Service Request 14 */
#define SRC_ID_CAN1INT15		395	/* CAN1 Service Request 15 */
#define SRC_ID_CAN2INT0			396	/* CAN2 Service Request 0 */
#define SRC_ID_CAN2INT1			397	/* CAN2 Service Request 1 */
#define SRC_ID_CAN2INT2			398	/* CAN2 Service Request 2 */
#define SRC_ID_CAN2INT3			399	/* CAN2 Service Request 3 */
#define SRC_ID_CAN2INT4			401	/* CAN2 Service Request 4 */
#define SRC_ID_CAN2INT5			401	/* CAN2 Service Request 5 */
#define SRC_ID_CAN2INT6			402	/* CAN2 Service Request 6 */
#define SRC_ID_CAN2INT7			403	/* CAN2 Service Request 7 */
#define SRC_ID_CAN2INT8			404	/* CAN2 Service Request 8 */
#define SRC_ID_CAN2INT9			405	/* CAN2 Service Request 9 */
#define SRC_ID_CAN2INT10		406	/* CAN2 Service Request 10 */
#define SRC_ID_CAN2INT11		407	/* CAN2 Service Request 11 */
#define SRC_ID_CAN2INT12		408	/* CAN2 Service Request 12 */
#define SRC_ID_CAN2INT13		409	/* CAN2 Service Request 13 */
#define SRC_ID_CAN2INT14		410	/* CAN2 Service Request 14 */
#define SRC_ID_CAN2INT15		411	/* CAN2 Service Request 15 */

#define SRC_ID_VADCG0SR0		412	/* EVADC Group  0 Service Request 0 */
#define SRC_ID_VADCG0SR1		413	/* EVADC Group  0 Service Request 1 */
#define SRC_ID_VADCG0SR2		414	/* EVADC Group  0 Service Request 2 */
#define SRC_ID_VADCG0SR3		415	/* EVADC Group  0 Service Request 3 */
#define SRC_ID_VADCG1SR0		416	/* EVADC Group  1 Service Request 0 */
#define SRC_ID_VADCG1SR1		417	/* EVADC Group  1 Service Request 1 */
#define SRC_ID_VADCG1SR2		418	/* EVADC Group  1 Service Request 2 */
#define SRC_ID_VADCG1SR3		419	/* EVADC Group  1 Service Request 3 */
#define SRC_ID_VADCG2SR0		420	/* EVADC Group  2 Service Request 0 */
#define SRC_ID_VADCG2SR1		421	/* EVADC Group  2 Service Request 1 */
#define SRC_ID_VADCG2SR2		422	/* EVADC Group  2 Service Request 2 */
#define SRC_ID_VADCG2SR3		423	/* EVADC Group  2 Service Request 3 */
#define SRC_ID_VADCG3SR0		424	/* EVADC Group  3 Service Request 0 */
#define SRC_ID_VADCG3SR1		425	/* EVADC Group  3 Service Request 1 */
#define SRC_ID_VADCG3SR2		426	/* EVADC Group  3 Service Request 2 */
#define SRC_ID_VADCG3SR3		427	/* EVADC Group  3 Service Request 3 */
#define SRC_ID_VADCG4SR0		428	/* EVADC Group  4 Service Request 0 */
#define SRC_ID_VADCG4SR1		429	/* EVADC Group  4 Service Request 1 */
#define SRC_ID_VADCG4SR2		430	/* EVADC Group  4 Service Request 2 */
#define SRC_ID_VADCG4SR3		431	/* EVADC Group  4 Service Request 3 */
#define SRC_ID_VADCG5SR0		432	/* EVADC Group  5 Service Request 0 */
#define SRC_ID_VADCG5SR1		433	/* EVADC Group  5 Service Request 1 */
#define SRC_ID_VADCG5SR2		434	/* EVADC Group  5 Service Request 2 */
#define SRC_ID_VADCG5SR3		435	/* EVADC Group  5 Service Request 3 */
#define SRC_ID_VADCG6SR0		436	/* EVADC Group  6 Service Request 0 */
#define SRC_ID_VADCG6SR1		437	/* EVADC Group  6 Service Request 1 */
#define SRC_ID_VADCG6SR2		438	/* EVADC Group  6 Service Request 2 */
#define SRC_ID_VADCG6SR3		439	/* EVADC Group  6 Service Request 3 */
#define SRC_ID_VADCG7SR0		440	/* EVADC Group  7 Service Request 0 */
#define SRC_ID_VADCG7SR1		441	/* EVADC Group  7 Service Request 1 */
#define SRC_ID_VADCG7SR2		442	/* EVADC Group  7 Service Request 2 */
#define SRC_ID_VADCG7SR3		443	/* EVADC Group  7 Service Request 3 */
#define SRC_ID_VADCG8SR0		444	/* EVADC Group  8 Service Request 0 */
#define SRC_ID_VADCG8SR1		445	/* EVADC Group  8 Service Request 1 */
#define SRC_ID_VADCG8SR2		446	/* EVADC Group  8 Service Request 2 */
#define SRC_ID_VADCG8SR3		447	/* EVADC Group  8 Service Request 3 */
#define SRC_ID_VADCG9SR0		448	/* EVADC Group  9 Service Request 0 */
#define SRC_ID_VADCG9SR1		449	/* EVADC Group  9 Service Request 1 */
#define SRC_ID_VADCG9SR2		450	/* EVADC Group  9 Service Request 2 */
#define SRC_ID_VADCG9SR3		451	/* EVADC Group  9 Service Request 3 */
#define SRC_ID_VADCG10SR0		452	/* EVADC Group 10 Service Request 0 */
#define SRC_ID_VADCG10SR1		453	/* EVADC Group 10 Service Request 1 */
#define SRC_ID_VADCG10SR2		454	/* EVADC Group 10 Service Request 2 */
#define SRC_ID_VADCG10SR3		455	/* EVADC Group 10 Service Request 3 */
#define SRC_ID_VADCG11SR0		456	/* EVADC Group 11 Service Request 0 */
#define SRC_ID_VADCG11SR1		457	/* EVADC Group 11 Service Request 1 */
#define SRC_ID_VADCG11SR2		458	/* EVADC Group 11 Service Request 2 */
#define SRC_ID_VADCG11SR3		459	/* EVADC Group 11 Service Request 3 */
#define SRC_ID_VADCFC0SR0		460	/* EVADC Fast Compare 0 Service Request 0 */
#define SRC_ID_VADCFC1SR0		461	/* EVADC Fast Compare 1 Service Request 0 */
#define SRC_ID_VADCFC2SR0		462	/* EVADC Fast Compare 2 Service Request 0 */
#define SRC_ID_VADCFC3SR0		463	/* EVADC Fast Compare 3 Service Request 0 */
#define SRC_ID_VADCFC4SR0		464	/* EVADC Fast Compare 4 Service Request 0 */
#define SRC_ID_VADCFC5SR0		465	/* EVADC Fast Compare 5 Service Request 0 */
#define SRC_ID_VADCFC6SR0		466	/* EVADC Fast Compare 6 Service Request 0 */
#define SRC_ID_VADCFC7SR0		467	/* EVADC Fast Compare 7 Service Request 0 */

#define SRC_ID_VADCCG0SR0		468	/* EVADC Common Group 0 Service Request 0 */
#define SRC_ID_VADCCG0SR1		469	/* EVADC Common Group 0 Service Request 1 */
#define SRC_ID_VADCCG0SR2		470	/* EVADC Common Group 0 Service Request 2 */
#define SRC_ID_VADCCG0SR3		471	/* EVADC Common Group 0 Service Request 3 */
#define SRC_ID_VADCCG1SR0		472	/* EVADC Common Group 1 Service Request 0 */
#define SRC_ID_VADCCG1SR1		473	/* EVADC Common Group 1 Service Request 1 */
#define SRC_ID_VADCCG1SR2		474	/* EVADC Common Group 1 Service Request 2 */
#define SRC_ID_VADCCG1SR3		475	/* EVADC Common Group 1 Service Request 3 */

#define SRC_ID_DSADCSRM0		476	/* DSADC SRM0 Service Request */
#define SRC_ID_DSADCSRA0		477	/* DSADC SRA0 Service Request */
#define SRC_ID_DSADCSRM1		478	/* DSADC SRM1 Service Request */
#define SRC_ID_DSADCSRA1		479	/* DSADC SRA1 Service Request */
#define SRC_ID_DSADCSRM2		480	/* DSADC SRM2 Service Request */
#define SRC_ID_DSADCSRA2		481	/* DSADC SRA2 Service Request */
#define SRC_ID_DSADCSRM3		482	/* DSADC SRM3 Service Request */
#define SRC_ID_DSADCSRA3		483	/* DSADC SRA3 Service Request */
#define SRC_ID_DSADCSRM4		484	/* DSADC SRM4 Service Request */
#define SRC_ID_DSADCSRA4		485	/* DSADC SRA4 Service Request */
#define SRC_ID_DSADCSRM5		486	/* DSADC SRM5 Service Request */
#define SRC_ID_DSADCSRA5		487	/* DSADC SRA5 Service Request */
#define SRC_ID_DSADCSRM6		488	/* DSADC SRM6 Service Request */
#define SRC_ID_DSADCSRA6		489	/* DSADC SRA6 Service Request */
#define SRC_ID_DSADCSRM7		490	/* DSADC SRM7 Service Request */
#define SRC_ID_DSADCSRA7		491	/* DSADC SRA7 Service Request */
#define SRC_ID_DSADCSRM8		492	/* DSADC SRM8 Service Request */
#define SRC_ID_DSADCSRA8		493	/* DSADC SRA8 Service Request */
#define SRC_ID_DSADCSRM9		494	/* DSADC SRM9 Service Request */
#define SRC_ID_DSADCSRA9		495	/* DSADC SRA9 Service Request */
#define SRC_ID_DSADCSRM10		496	/* DSADC SRM10 Service Request */
#define SRC_ID_DSADCSRA10		497	/* DSADC SRA10 Service Request */
#define SRC_ID_DSADCSRM11		498	/* DSADC SRM11 Service Request */
#define SRC_ID_DSADCSRA11		499	/* DSADC SRA11 Service Request */
#define SRC_ID_DSADCSRM12		500	/* DSADC SRM12 Service Request */
#define SRC_ID_DSADCSRA12		501	/* DSADC SRA12 Service Request */
#define SRC_ID_DSADCSRM13		502	/* DSADC SRM13 Service Request */
#define SRC_ID_DSADCSRA13		503	/* DSADC SRA13 Service Request */

#define SRC_ID_ERAY0INT0		512	/* E-RAY 0 Service Request 0 */
#define SRC_ID_ERAY0INT1		513	/* E-RAY 0 Service Request 1 */
#define SRC_ID_ERAY0TINT0		514	/* E-RAY 0 Timer Interrupt 0 Service Request */
#define SRC_ID_ERAY0TINT1		515	/* E-RAY 0 Timer Interrupt 1 Service Request */
#define SRC_ID_ERAY0NDAT0		516	/* E-RAY 0 New Data 0 Service Request */
#define SRC_ID_ERAY0NDAT1		517	/* E-RAY 0 New Data 1 Service Request */
#define SRC_ID_ERAY0MBSC0		518	/* E-RAY 0 Message Buffer Status Changed 0 Service Request */
#define SRC_ID_ERAY0MBSC1		519	/* E-RAY 0 Message Buffer Status Changed 1 Service Request */
#define SRC_ID_ERAY0OBUSY		520	/* E-RAY 0 Output Buffer Busy Service Request */
#define SRC_ID_ERAY0IBUSY		521	/* E-RAY 0 Input Buffer Busy Service Request */
#define SRC_ID_ERAY1INT0		524	/* E-RAY 1 Service Request 0 */
#define SRC_ID_ERAY1INT1		525	/* E-RAY 1 Service Request 1 */
#define SRC_ID_ERAY1TINT0		526	/* E-RAY 1 Timer Interrupt 0 Service Request */
#define SRC_ID_ERAY1TINT1		527	/* E-RAY 1 Timer Interrupt 1 Service Request */
#define SRC_ID_ERAY1NDAT0		528	/* E-RAY 1 New Data 0 Service Request */
#define SRC_ID_ERAY1NDAT1		529	/* E-RAY 1 New Data 1 Service Request */
#define SRC_ID_ERAY1MBSC0		530	/* E-RAY 1 Message Buffer Status Changed 0 Service Request */
#define SRC_ID_ERAY1MBSC1		531	/* E-RAY 1 Message Buffer Status Changed 1 Service Request */
#define SRC_ID_ERAY1OBUSY		532	/* E-RAY 1 Output Buffer Busy Service Request */
#define SRC_ID_ERAY1IBUSY		533	/* E-RAY 1 Input Buffer Busy Service Request */

