zx568073531/stm32f429_pjsip/Middlewares/CycloneTCP_SSL_SSH_CRYPTO_Open_2_1_4/third_party/infineon/boards/kit_a2g_tc397_tft/intids_tc39xb.h
#define SRC_ID_DMUHOST			536	/* DMU Host Service Request */
#define SRC_ID_DMUFSI			537	/* DMU FSI Service Request */

#define SRC_ID_HSM0				540	/* HSM Service Request 0 */
#define SRC_ID_HSM1				541	/* HSM Service Request 1 */

#define SRC_ID_SCUERU0			544	/* SCU ERU Service Request 0 */
#define SRC_ID_SCUERU1			545	/* SCU ERU Service Request 1 */
#define SRC_ID_SCUERU2			546	/* SCU ERU Service Request 2 */
#define SRC_ID_SCUERU3			547	/* SCU ERU Service Request 3 */

#define SRC_ID_PMSDTS			555	/* PMS DTS Service Request */
#define SRC_ID_PMS0				556	/* PMS Service Request 0 */
#define SRC_ID_PMS1				557	/* PMS Service Request 1 */
#define SRC_ID_PMS2				558	/* PMS Service Request 2 */
#define SRC_ID_PMS3				559	/* PMS Service Request 3 */
#define SRC_ID_SCR				560	/* Standby Controller (SCR) Service Request */

#define SRC_ID_SMU0				564	/* SMU Service Request 0 */
#define SRC_ID_SMU1				565	/* SMU Service Request 1 */
#define SRC_ID_SMU2				566	/* SMU Service Request 2 */

#define SRC_ID_PSI50			568	/* PSI5 Service Request 0 */
#define SRC_ID_PSI51			569	/* PSI5 Service Request 1 */
#define SRC_ID_PSI52			570	/* PSI5 Service Request 2 */
#define SRC_ID_PSI53			571	/* PSI5 Service Request 3 */
#define SRC_ID_PSI54			572	/* PSI5 Service Request 4 */
#define SRC_ID_PSI55			573	/* PSI5 Service Request 5 */
#define SRC_ID_PSI56			574	/* PSI5 Service Request 6 */
#define SRC_ID_PSI57			575	/* PSI5 Service Request 7 */

#define SRC_ID_HSPDM0BFR		576	/* HSPDM0 Buffer Service Request */
#define SRC_ID_HSPDM0RAMP		577	/* HSPDM0 RAMP Events Service Request */
#define SRC_ID_HSPDM0ERR		578	/* HSPDM0 Error / RAM Overflow Service Request */

#define SRC_ID_DAM0LI0			580	/* DAM0 Limit 0 Service Request */
#define SRC_ID_DAM0RI0			581	/* DAM0 Ready 0 Service Request */
#define SRC_ID_DAM0LI1			582	/* DAM0 Limit 1 Service Request */
#define SRC_ID_DAM0RI1			583	/* DAM0 Ready 1 Service Request */
#define SRC_ID_DAM0DR			584	/* DAM0 DMA Ready Service Request */
#define SRC_ID_DAM0ERR			585	/* DAM0 Error Service Request */
#define SRC_ID_DAM1LI0			586	/* DAM1 Limit 0 Service Request */
#define SRC_ID_DAM1RI0			587	/* DAM1 Ready 0 Service Request */
#define SRC_ID_DAM1LI1			588	/* DAM1 Limit 1 Service Request */
#define SRC_ID_DAM1RI1			589	/* DAM1 Ready 1 Service Request */
#define SRC_ID_DAM1DR			590	/* DAM1 DMA Ready Service Request */
#define SRC_ID_DAM1ERR			591	/* DAM1 Error Service Request */

#define SRC_ID_PSI5S0			596	/* PSI5-S Service Request 0 */
#define SRC_ID_PSI5S1			597	/* PSI5-S Service Request 1 */
#define SRC_ID_PSI5S2			598	/* PSI5-S Service Request 2 */
#define SRC_ID_PSI5S3			599	/* PSI5-S Service Request 3 */
#define SRC_ID_PSI5S4			600	/* PSI5-S Service Request 4 */
#define SRC_ID_PSI5S5			601	/* PSI5-S Service Request 5 */
#define SRC_ID_PSI5S6			602	/* PSI5-S Service Request 6 */
#define SRC_ID_PSI5S7			603	/* PSI5-S Service Request 7 */

#define SRC_ID_RIF0ERR			604	/* RIF 0 Error Service Request */
#define SRC_ID_RIF0INT			605	/* RIF 0 Service Request */
#define SRC_ID_RIF1ERR			606	/* RIF 1 Error Service Request */
#define SRC_ID_RIF1INT			607	/* RIF 1 Service Request */

#define SRC_ID_SPU0ERR			608	/* SPU 0 Error Service Request */
#define SRC_ID_SPU0INT			609	/* SPU 0 Service Request */
#define SRC_ID_SPU1ERR			610	/* SPU 1 Error Service Request */
#define SRC_ID_SPU1INT			611	/* SPU 1 Service Request */

#define SRC_ID_GPSR00			612	/* General Purpose Service Request 0 0 */
#define SRC_ID_GPSR01			613	/* General Purpose Service Request 0 1 */
#define SRC_ID_GPSR02			614	/* General Purpose Service Request 0 2 */
#define SRC_ID_GPSR03			615	/* General Purpose Service Request 0 3 */
#define SRC_ID_GPSR04			616	/* General Purpose Service Request 0 4 */
#define SRC_ID_GPSR05			617	/* General Purpose Service Request 0 5 */
#define SRC_ID_GPSR06			618	/* General Purpose Service Request 0 6 */
#define SRC_ID_GPSR07			619	/* General Purpose Service Request 0 7 */

#define SRC_ID_GPSR10			620	/* General Purpose Service Request 1 0 */
#define SRC_ID_GPSR11			621	/* General Purpose Service Request 1 1 */
#define SRC_ID_GPSR12			622	/* General Purpose Service Request 1 2 */
#define SRC_ID_GPSR13			623	/* General Purpose Service Request 1 3 */
#define SRC_ID_GPSR14			624	/* General Purpose Service Request 1 4 */
#define SRC_ID_GPSR15			625	/* General Purpose Service Request 1 5 */
#define SRC_ID_GPSR16			626	/* General Purpose Service Request 1 6 */
#define SRC_ID_GPSR17			627	/* General Purpose Service Request 1 7 */

#define SRC_ID_GPSR20			628	/* General Purpose Service Request 2 0 */
#define SRC_ID_GPSR21			629	/* General Purpose Service Request 2 1 */
#define SRC_ID_GPSR22			630	/* General Purpose Service Request 2 2 */
#define SRC_ID_GPSR23			631	/* General Purpose Service Request 2 3 */
#define SRC_ID_GPSR24			632	/* General Purpose Service Request 2 4 */
#define SRC_ID_GPSR25			633	/* General Purpose Service Request 2 5 */
#define SRC_ID_GPSR26			634	/* General Purpose Service Request 2 6 */
#define SRC_ID_GPSR27			635	/* General Purpose Service Request 2 7 */

#define SRC_ID_GPSR30			636	/* General Purpose Service Request 3 0 */
#define SRC_ID_GPSR31			637	/* General Purpose Service Request 3 1 */
#define SRC_ID_GPSR32			638	/* General Purpose Service Request 3 2 */
#define SRC_ID_GPSR33			639	/* General Purpose Service Request 3 3 */
#define SRC_ID_GPSR34			640	/* General Purpose Service Request 3 4 */
#define SRC_ID_GPSR35			641	/* General Purpose Service Request 3 5 */
#define SRC_ID_GPSR36			642	/* General Purpose Service Request 3 6 */
#define SRC_ID_GPSR37			643	/* General Purpose Service Request 3 7 */

#define SRC_ID_GPSR40			644	/* General Purpose Service Request 4 0 */
#define SRC_ID_GPSR41			645	/* General Purpose Service Request 4 1 */
#define SRC_ID_GPSR42			646	/* General Purpose Service Request 4 2 */
#define SRC_ID_GPSR43			647	/* General Purpose Service Request 4 3 */
#define SRC_ID_GPSR44			648	/* General Purpose Service Request 4 4 */
#define SRC_ID_GPSR45			649	/* General Purpose Service Request 4 5 */
#define SRC_ID_GPSR46			650	/* General Purpose Service Request 4 6 */
#define SRC_ID_GPSR47			651	/* General Purpose Service Request 4 7 */

