zx568073531/stm32f429_pjsip/Middlewares/CycloneTCP_SSL_SSH_CRYPTO_Open_2_1_4/third_party/infineon/boards/kit_a2g_tc397_tft/intids_tc39xb.h
#define SRC_ID_GPSR50			652	/* General Purpose Service Request 5 0 */
#define SRC_ID_GPSR51			653	/* General Purpose Service Request 5 1 */
#define SRC_ID_GPSR52			654	/* General Purpose Service Request 5 2 */
#define SRC_ID_GPSR53			655	/* General Purpose Service Request 5 3 */
#define SRC_ID_GPSR54			656	/* General Purpose Service Request 5 4 */
#define SRC_ID_GPSR55			657	/* General Purpose Service Request 5 5 */
#define SRC_ID_GPSR56			658	/* General Purpose Service Request 5 6 */
#define SRC_ID_GPSR57			659	/* General Purpose Service Request 5 7 */

#define SRC_ID_GTMAEIIRQ		668	/* GTM AEI Shared Service Request */
#define SRC_ID_GTMARUIRQ0		669	/* GTM ARU Shared Service Request 0 */
#define SRC_ID_GTMARUIRQ1		670	/* GTM ARU Shared Service Request 1 */
#define SRC_ID_GTMARUIRQ2		671	/* GTM ARU Shared Service Request 2 */

#define SRC_ID_GTMBRCIRQ		672	/* GTM BRC Shared Service Request */
#define SRC_ID_GTMCMPIRQ		673	/* GTM CMP Shared Service Request */
#define SRC_ID_GTMSPE0IRQ		674	/* GTM SPE0 Shared Service Request */
#define SRC_ID_GTMSPE1IRQ		675	/* GTM SPE1 Shared Service Request */
#define SRC_ID_GTMSPE2IRQ		676	/* GTM SPE2 Shared Service Request */
#define SRC_ID_GTMSPE3IRQ		677	/* GTM SPE3 Shared Service Request */
#define SRC_ID_GTMSPE4IRQ		678	/* GTM SPE4 Shared Service Request */
#define SRC_ID_GTMSPE5IRQ		679	/* GTM SPE5 Shared Service Request */

#define SRC_ID_GTMPSM00			680	/* GTM PSM0 Shared Service Request 0 */
#define SRC_ID_GTMPSM01			681	/* GTM PSM0 Shared Service Request 1 */
#define SRC_ID_GTMPSM02			682	/* GTM PSM0 Shared Service Request 2 */
#define SRC_ID_GTMPSM03			683	/* GTM PSM0 Shared Service Request 3 */
#define SRC_ID_GTMPSM04			684	/* GTM PSM0 Shared Service Request 4 */
#define SRC_ID_GTMPSM05			685	/* GTM PSM0 Shared Service Request 5 */
#define SRC_ID_GTMPSM06			686	/* GTM PSM0 Shared Service Request 6 */
#define SRC_ID_GTMPSM07			687	/* GTM PSM0 Shared Service Request 7 */

#define SRC_ID_GTMPSM10			688	/* GTM PSM1 Shared Service Request 0 */
#define SRC_ID_GTMPSM11			689	/* GTM PSM1 Shared Service Request 1 */
#define SRC_ID_GTMPSM12			690	/* GTM PSM1 Shared Service Request 2 */
#define SRC_ID_GTMPSM13			691	/* GTM PSM1 Shared Service Request 3 */
#define SRC_ID_GTMPSM14			692	/* GTM PSM1 Shared Service Request 4 */
#define SRC_ID_GTMPSM15			693	/* GTM PSM1 Shared Service Request 5 */
#define SRC_ID_GTMPSM16			694	/* GTM PSM1 Shared Service Request 6 */
#define SRC_ID_GTMPSM17			695	/* GTM PSM1 Shared Service Request 7 */

#define SRC_ID_GTMPSM20			696	/* GTM PSM2 Shared Service Request 0 */
#define SRC_ID_GTMPSM21			697	/* GTM PSM2 Shared Service Request 1 */
#define SRC_ID_GTMPSM22			698	/* GTM PSM2 Shared Service Request 2 */
#define SRC_ID_GTMPSM23			699	/* GTM PSM2 Shared Service Request 3 */
#define SRC_ID_GTMPSM24			700	/* GTM PSM2 Shared Service Request 4 */
#define SRC_ID_GTMPSM25			701	/* GTM PSM2 Shared Service Request 5 */
#define SRC_ID_GTMPSM26			702	/* GTM PSM2 Shared Service Request 6 */
#define SRC_ID_GTMPSM27			703	/* GTM PSM2 Shared Service Request 7 */

#define SRC_ID_GTMDPLL0			704	/* GTM DPLL Service Request 0 */
#define SRC_ID_GTMDPLL1			705	/* GTM DPLL Service Request 1 */
#define SRC_ID_GTMDPLL2			706	/* GTM DPLL Service Request 2 */
#define SRC_ID_GTMDPLL3			707	/* GTM DPLL Service Request 3 */
#define SRC_ID_GTMDPLL4			708	/* GTM DPLL Service Request 4 */
#define SRC_ID_GTMDPLL5			709	/* GTM DPLL Service Request 5 */
#define SRC_ID_GTMDPLL6			710	/* GTM DPLL Service Request 6 */
#define SRC_ID_GTMDPLL7			711	/* GTM DPLL Service Request 7 */
#define SRC_ID_GTMDPLL8			712	/* GTM DPLL Service Request 8 */
#define SRC_ID_GTMDPLL9			713	/* GTM DPLL Service Request 9 */
#define SRC_ID_GTMDPLL10		714	/* GTM DPLL Service Request 10 */
#define SRC_ID_GTMDPLL11		715	/* GTM DPLL Service Request 11 */
#define SRC_ID_GTMDPLL12		716	/* GTM DPLL Service Request 12 */
#define SRC_ID_GTMDPLL13		717	/* GTM DPLL Service Request 13 */
#define SRC_ID_GTMDPLL14		718	/* GTM DPLL Service Request 14 */
#define SRC_ID_GTMDPLL15		719	/* GTM DPLL Service Request 15 */
#define SRC_ID_GTMDPLL16		720	/* GTM DPLL Service Request 16 */
#define SRC_ID_GTMDPLL17		721	/* GTM DPLL Service Request 17 */
#define SRC_ID_GTMDPLL18		722	/* GTM DPLL Service Request 18 */
#define SRC_ID_GTMDPLL19		723	/* GTM DPLL Service Request 19 */
#define SRC_ID_GTMDPLL20		724	/* GTM DPLL Service Request 20 */
#define SRC_ID_GTMDPLL21		725	/* GTM DPLL Service Request 21 */
#define SRC_ID_GTMDPLL22		726	/* GTM DPLL Service Request 22 */
#define SRC_ID_GTMDPLL23		727	/* GTM DPLL Service Request 23 */
#define SRC_ID_GTMDPLL24		728	/* GTM DPLL Service Request 24 */
#define SRC_ID_GTMDPLL25		729	/* GTM DPLL Service Request 25 */
#define SRC_ID_GTMDPLL26		730	/* GTM DPLL Service Request 26 */

#define SRC_ID_GTMERR			732	/* GTM Error Service Request */

#define SRC_ID_GTMTIM00			740	/* GTM TIM0 Shared Service Request 0 */
#define SRC_ID_GTMTIM01			741	/* GTM TIM0 Shared Service Request 1 */
#define SRC_ID_GTMTIM02			742	/* GTM TIM0 Shared Service Request 2 */
#define SRC_ID_GTMTIM03			743	/* GTM TIM0 Shared Service Request 3 */
#define SRC_ID_GTMTIM04			744	/* GTM TIM0 Shared Service Request 4 */
#define SRC_ID_GTMTIM05			745	/* GTM TIM0 Shared Service Request 5 */
#define SRC_ID_GTMTIM06			746	/* GTM TIM0 Shared Service Request 6 */
#define SRC_ID_GTMTIM07			747	/* GTM TIM0 Shared Service Request 7 */
#define SRC_ID_GTMTIM10			748	/* GTM TIM1 Shared Service Request 0 */
#define SRC_ID_GTMTIM11			749	/* GTM TIM1 Shared Service Request 1 */
#define SRC_ID_GTMTIM12			750	/* GTM TIM1 Shared Service Request 2 */
#define SRC_ID_GTMTIM13			751	/* GTM TIM1 Shared Service Request 3 */
#define SRC_ID_GTMTIM14			752	/* GTM TIM1 Shared Service Request 4 */
#define SRC_ID_GTMTIM15			753	/* GTM TIM1 Shared Service Request 5 */
#define SRC_ID_GTMTIM16			754	/* GTM TIM1 Shared Service Request 6 */
#define SRC_ID_GTMTIM17			755	/* GTM TIM1 Shared Service Request 7 */
#define SRC_ID_GTMTIM20			756	/* GTM TIM2 Shared Service Request 0 */
#define SRC_ID_GTMTIM21			757	/* GTM TIM2 Shared Service Request 1 */
#define SRC_ID_GTMTIM22			758	/* GTM TIM2 Shared Service Request 2 */
#define SRC_ID_GTMTIM23			759	/* GTM TIM2 Shared Service Request 3 */
#define SRC_ID_GTMTIM24			760	/* GTM TIM2 Shared Service Request 4 */
#define SRC_ID_GTMTIM25			761	/* GTM TIM2 Shared Service Request 5 */
#define SRC_ID_GTMTIM26			762	/* GTM TIM2 Shared Service Request 6 */
#define SRC_ID_GTMTIM27			763	/* GTM TIM2 Shared Service Request 7 */
#define SRC_ID_GTMTIM30			764	/* GTM TIM3 Shared Service Request 0 */
#define SRC_ID_GTMTIM31			765	/* GTM TIM3 Shared Service Request 1 */
#define SRC_ID_GTMTIM32			766	/* GTM TIM3 Shared Service Request 2 */
#define SRC_ID_GTMTIM33			767	/* GTM TIM3 Shared Service Request 3 */
#define SRC_ID_GTMTIM34			768	/* GTM TIM3 Shared Service Request 4 */
#define SRC_ID_GTMTIM35			769	/* GTM TIM3 Shared Service Request 5 */
#define SRC_ID_GTMTIM36			770	/* GTM TIM3 Shared Service Request 6 */
#define SRC_ID_GTMTIM37			771	/* GTM TIM3 Shared Service Request 7 */
#define SRC_ID_GTMTIM40			772	/* GTM TIM4 Shared Service Request 0 */
#define SRC_ID_GTMTIM41			773	/* GTM TIM4 Shared Service Request 1 */
#define SRC_ID_GTMTIM42			774	/* GTM TIM4 Shared Service Request 2 */
#define SRC_ID_GTMTIM43			775	/* GTM TIM4 Shared Service Request 3 */
#define SRC_ID_GTMTIM44			776	/* GTM TIM4 Shared Service Request 4 */
#define SRC_ID_GTMTIM45			777	/* GTM TIM4 Shared Service Request 5 */
#define SRC_ID_GTMTIM46			778	/* GTM TIM4 Shared Service Request 6 */
#define SRC_ID_GTMTIM47			779	/* GTM TIM4 Shared Service Request 7 */
#define SRC_ID_GTMTIM50			780	/* GTM TIM5 Shared Service Request 0 */
#define SRC_ID_GTMTIM51			781	/* GTM TIM5 Shared Service Request 1 */
#define SRC_ID_GTMTIM52			782	/* GTM TIM5 Shared Service Request 2 */
#define SRC_ID_GTMTIM53			783	/* GTM TIM5 Shared Service Request 3 */
#define SRC_ID_GTMTIM54			784	/* GTM TIM5 Shared Service Request 4 */
#define SRC_ID_GTMTIM55			785	/* GTM TIM5 Shared Service Request 5 */
#define SRC_ID_GTMTIM56			786	/* GTM TIM5 Shared Service Request 6 */
#define SRC_ID_GTMTIM57			787	/* GTM TIM5 Shared Service Request 7 */
#define SRC_ID_GTMTIM60			788	/* GTM TIM6 Shared Service Request 0 */
#define SRC_ID_GTMTIM61			789	/* GTM TIM6 Shared Service Request 1 */
#define SRC_ID_GTMTIM62			790	/* GTM TIM6 Shared Service Request 2 */
#define SRC_ID_GTMTIM63			791	/* GTM TIM6 Shared Service Request 3 */
#define SRC_ID_GTMTIM64			792	/* GTM TIM6 Shared Service Request 4 */
#define SRC_ID_GTMTIM65			793	/* GTM TIM6 Shared Service Request 5 */
#define SRC_ID_GTMTIM66			794	/* GTM TIM6 Shared Service Request 6 */
#define SRC_ID_GTMTIM67			795	/* GTM TIM6 Shared Service Request 7 */
#define SRC_ID_GTMTIM70			796	/* GTM TIM7 Shared Service Request 0 */
#define SRC_ID_GTMTIM71			797	/* GTM TIM7 Shared Service Request 1 */
#define SRC_ID_GTMTIM72			798	/* GTM TIM7 Shared Service Request 2 */
#define SRC_ID_GTMTIM73			799	/* GTM TIM7 Shared Service Request 3 */
#define SRC_ID_GTMTIM74			800	/* GTM TIM7 Shared Service Request 4 */
#define SRC_ID_GTMTIM75			801	/* GTM TIM7 Shared Service Request 5 */
#define SRC_ID_GTMTIM76			802	/* GTM TIM7 Shared Service Request 6 */
#define SRC_ID_GTMTIM77			803	/* GTM TIM7 Shared Service Request 7 */

#define SRC_ID_GTMMSC00			812	/* GTM MCS0 Shared Service Request 0 */
#define SRC_ID_GTMMSC01			813	/* GTM MCS0 Shared Service Request 1 */
#define SRC_ID_GTMMSC02			814	/* GTM MCS0 Shared Service Request 2 */
#define SRC_ID_GTMMSC03			815	/* GTM MCS0 Shared Service Request 3 */
#define SRC_ID_GTMMSC04			816	/* GTM MCS0 Shared Service Request 4 */
#define SRC_ID_GTMMSC05			817	/* GTM MCS0 Shared Service Request 5 */
#define SRC_ID_GTMMSC06			818	/* GTM MCS0 Shared Service Request 6 */
#define SRC_ID_GTMMSC07			819	/* GTM MCS0 Shared Service Request 7 */
#define SRC_ID_GTMMSC10			820	/* GTM MCS1 Shared Service Request 0 */
#define SRC_ID_GTMMSC11			821	/* GTM MCS1 Shared Service Request 1 */
#define SRC_ID_GTMMSC12			822	/* GTM MCS1 Shared Service Request 2 */
#define SRC_ID_GTMMSC13			823	/* GTM MCS1 Shared Service Request 3 */
#define SRC_ID_GTMMSC14			824	/* GTM MCS1 Shared Service Request 4 */
#define SRC_ID_GTMMSC15			825	/* GTM MCS1 Shared Service Request 5 */
#define SRC_ID_GTMMSC16			826	/* GTM MCS1 Shared Service Request 6 */
#define SRC_ID_GTMMSC17			827	/* GTM MCS1 Shared Service Request 7 */
#define SRC_ID_GTMMSC20			828	/* GTM MCS2 Shared Service Request 0 */
#define SRC_ID_GTMMSC21			829	/* GTM MCS2 Shared Service Request 1 */
#define SRC_ID_GTMMSC22			830	/* GTM MCS2 Shared Service Request 2 */
#define SRC_ID_GTMMSC23			831	/* GTM MCS2 Shared Service Request 3 */
#define SRC_ID_GTMMSC24			832	/* GTM MCS2 Shared Service Request 4 */
#define SRC_ID_GTMMSC25			833	/* GTM MCS2 Shared Service Request 5 */
#define SRC_ID_GTMMSC26			834	/* GTM MCS2 Shared Service Request 6 */
#define SRC_ID_GTMMSC27			835	/* GTM MCS2 Shared Service Request 7 */
#define SRC_ID_GTMMSC30			836	/* GTM MCS3 Shared Service Request 0 */
#define SRC_ID_GTMMSC31			837	/* GTM MCS3 Shared Service Request 1 */
#define SRC_ID_GTMMSC32			838	/* GTM MCS3 Shared Service Request 2 */
#define SRC_ID_GTMMSC33			839	/* GTM MCS3 Shared Service Request 3 */
#define SRC_ID_GTMMSC34			840	/* GTM MCS3 Shared Service Request 4 */
#define SRC_ID_GTMMSC35			841	/* GTM MCS3 Shared Service Request 5 */
#define SRC_ID_GTMMSC36			842	/* GTM MCS3 Shared Service Request 6 */
#define SRC_ID_GTMMSC37			843	/* GTM MCS3 Shared Service Request 7 */
#define SRC_ID_GTMMSC40			844	/* GTM MCS4 Shared Service Request 0 */
#define SRC_ID_GTMMSC41			845	/* GTM MCS4 Shared Service Request 1 */
#define SRC_ID_GTMMSC42			846	/* GTM MCS4 Shared Service Request 2 */
#define SRC_ID_GTMMSC43			847	/* GTM MCS4 Shared Service Request 3 */
#define SRC_ID_GTMMSC44			848	/* GTM MCS4 Shared Service Request 4 */
#define SRC_ID_GTMMSC45			849	/* GTM MCS4 Shared Service Request 5 */
#define SRC_ID_GTMMSC46			850	/* GTM MCS4 Shared Service Request 6 */
#define SRC_ID_GTMMSC47			851	/* GTM MCS4 Shared Service Request 7 */
#define SRC_ID_GTMMSC50			852	/* GTM MCS5 Shared Service Request 0 */
#define SRC_ID_GTMMSC51			853	/* GTM MCS5 Shared Service Request 1 */
#define SRC_ID_GTMMSC52			854	/* GTM MCS5 Shared Service Request 2 */
#define SRC_ID_GTMMSC53			855	/* GTM MCS5 Shared Service Request 3 */
#define SRC_ID_GTMMSC54			856	/* GTM MCS5 Shared Service Request 4 */
#define SRC_ID_GTMMSC55			857	/* GTM MCS5 Shared Service Request 5 */
#define SRC_ID_GTMMSC56			858	/* GTM MCS5 Shared Service Request 6 */
#define SRC_ID_GTMMSC57			859	/* GTM MCS5 Shared Service Request 7 */
#define SRC_ID_GTMMSC60			860	/* GTM MCS6 Shared Service Request 0 */
#define SRC_ID_GTMMSC61			861	/* GTM MCS6 Shared Service Request 1 */
#define SRC_ID_GTMMSC62			862	/* GTM MCS6 Shared Service Request 2 */
#define SRC_ID_GTMMSC63			863	/* GTM MCS6 Shared Service Request 3 */
#define SRC_ID_GTMMSC64			864	/* GTM MCS6 Shared Service Request 4 */
#define SRC_ID_GTMMSC65			865	/* GTM MCS6 Shared Service Request 5 */
#define SRC_ID_GTMMSC66			866	/* GTM MCS6 Shared Service Request 6 */
#define SRC_ID_GTMMSC67			867	/* GTM MCS6 Shared Service Request 7 */
#define SRC_ID_GTMMSC70			868	/* GTM MCS7 Shared Service Request 0 */
#define SRC_ID_GTMMSC71			869	/* GTM MCS7 Shared Service Request 1 */
#define SRC_ID_GTMMSC72			870	/* GTM MCS7 Shared Service Request 2 */
#define SRC_ID_GTMMSC73			871	/* GTM MCS7 Shared Service Request 3 */
#define SRC_ID_GTMMSC74			872	/* GTM MCS7 Shared Service Request 4 */
#define SRC_ID_GTMMSC75			873	/* GTM MCS7 Shared Service Request 5 */
#define SRC_ID_GTMMSC76			874	/* GTM MCS7 Shared Service Request 6 */
#define SRC_ID_GTMMSC77			875	/* GTM MCS7 Shared Service Request 7 */
#define SRC_ID_GTMMSC80			876	/* GTM MCS8 Shared Service Request 0 */
#define SRC_ID_GTMMSC81			877	/* GTM MCS8 Shared Service Request 1 */
#define SRC_ID_GTMMSC82			878	/* GTM MCS8 Shared Service Request 2 */
#define SRC_ID_GTMMSC83			879	/* GTM MCS8 Shared Service Request 3 */
#define SRC_ID_GTMMSC84			880	/* GTM MCS8 Shared Service Request 4 */
#define SRC_ID_GTMMSC85			881	/* GTM MCS8 Shared Service Request 5 */
#define SRC_ID_GTMMSC86			882	/* GTM MCS8 Shared Service Request 6 */
#define SRC_ID_GTMMSC87			883	/* GTM MCS8 Shared Service Request 7 */
#define SRC_ID_GTMMSC90			884	/* GTM MCS9 Shared Service Request 0 */
#define SRC_ID_GTMMSC91			885	/* GTM MCS9 Shared Service Request 1 */
#define SRC_ID_GTMMSC92			886	/* GTM MCS9 Shared Service Request 2 */
#define SRC_ID_GTMMSC93			887	/* GTM MCS9 Shared Service Request 3 */
#define SRC_ID_GTMMSC94			888	/* GTM MCS9 Shared Service Request 4 */
#define SRC_ID_GTMMSC95			889	/* GTM MCS9 Shared Service Request 5 */
#define SRC_ID_GTMMSC96			890	/* GTM MCS9 Shared Service Request 6 */
#define SRC_ID_GTMMSC97			891	/* GTM MCS9 Shared Service Request 7 */

