zx568073531/stm32f429_pjsip/Middlewares/CycloneTCP_SSL_SSH_CRYPTO_Open_2_1_4/third_party/infineon/boards/kit_a2g_tc397_tft/intids_tc39xb.h
#define SRC_ID_GTMTOM00			900	/* GTM TOM0 Shared Service Request 0 */
#define SRC_ID_GTMTOM01			901	/* GTM TOM0 Shared Service Request 1 */
#define SRC_ID_GTMTOM02			902	/* GTM TOM0 Shared Service Request 2 */
#define SRC_ID_GTMTOM03			903	/* GTM TOM0 Shared Service Request 3 */
#define SRC_ID_GTMTOM04			904	/* GTM TOM0 Shared Service Request 4 */
#define SRC_ID_GTMTOM05			905	/* GTM TOM0 Shared Service Request 5 */
#define SRC_ID_GTMTOM06			906	/* GTM TOM0 Shared Service Request 6 */
#define SRC_ID_GTMTOM07			907	/* GTM TOM0 Shared Service Request 7 */
#define SRC_ID_GTMTOM10			908	/* GTM TOM1 Shared Service Request 0 */
#define SRC_ID_GTMTOM11			909	/* GTM TOM1 Shared Service Request 1 */
#define SRC_ID_GTMTOM12			910	/* GTM TOM1 Shared Service Request 2 */
#define SRC_ID_GTMTOM13			911	/* GTM TOM1 Shared Service Request 3 */
#define SRC_ID_GTMTOM14			912	/* GTM TOM1 Shared Service Request 4 */
#define SRC_ID_GTMTOM15			913	/* GTM TOM1 Shared Service Request 5 */
#define SRC_ID_GTMTOM16			914	/* GTM TOM1 Shared Service Request 6 */
#define SRC_ID_GTMTOM17			915	/* GTM TOM1 Shared Service Request 7 */
#define SRC_ID_GTMTOM20			916	/* GTM TOM2 Shared Service Request 0 */
#define SRC_ID_GTMTOM21			917	/* GTM TOM2 Shared Service Request 1 */
#define SRC_ID_GTMTOM22			918	/* GTM TOM2 Shared Service Request 2 */
#define SRC_ID_GTMTOM23			919	/* GTM TOM2 Shared Service Request 3 */
#define SRC_ID_GTMTOM24			920	/* GTM TOM2 Shared Service Request 4 */
#define SRC_ID_GTMTOM25			921	/* GTM TOM2 Shared Service Request 5 */
#define SRC_ID_GTMTOM26			922	/* GTM TOM2 Shared Service Request 6 */
#define SRC_ID_GTMTOM27			923	/* GTM TOM2 Shared Service Request 7 */
#define SRC_ID_GTMTOM30			924	/* GTM TOM3 Shared Service Request 0 */
#define SRC_ID_GTMTOM31			925	/* GTM TOM3 Shared Service Request 1 */
#define SRC_ID_GTMTOM32			926	/* GTM TOM3 Shared Service Request 2 */
#define SRC_ID_GTMTOM33			927	/* GTM TOM3 Shared Service Request 3 */
#define SRC_ID_GTMTOM34			928	/* GTM TOM3 Shared Service Request 4 */
#define SRC_ID_GTMTOM35			929	/* GTM TOM3 Shared Service Request 5 */
#define SRC_ID_GTMTOM36			930	/* GTM TOM3 Shared Service Request 6 */
#define SRC_ID_GTMTOM37			931	/* GTM TOM3 Shared Service Request 7 */
#define SRC_ID_GTMTOM40			932	/* GTM TOM4 Shared Service Request 0 */
#define SRC_ID_GTMTOM41			933	/* GTM TOM4 Shared Service Request 1 */
#define SRC_ID_GTMTOM42			934	/* GTM TOM4 Shared Service Request 2 */
#define SRC_ID_GTMTOM43			935	/* GTM TOM4 Shared Service Request 3 */
#define SRC_ID_GTMTOM44			936	/* GTM TOM4 Shared Service Request 4 */
#define SRC_ID_GTMTOM45			937	/* GTM TOM4 Shared Service Request 5 */
#define SRC_ID_GTMTOM46			938	/* GTM TOM4 Shared Service Request 6 */
#define SRC_ID_GTMTOM47			939	/* GTM TOM4 Shared Service Request 7 */
#define SRC_ID_GTMTOM50			940	/* GTM TOM5 Shared Service Request 0 */
#define SRC_ID_GTMTOM51			941	/* GTM TOM5 Shared Service Request 1 */
#define SRC_ID_GTMTOM52			942	/* GTM TOM5 Shared Service Request 2 */
#define SRC_ID_GTMTOM53			943	/* GTM TOM5 Shared Service Request 3 */
#define SRC_ID_GTMTOM54			944	/* GTM TOM5 Shared Service Request 4 */
#define SRC_ID_GTMTOM55			945	/* GTM TOM5 Shared Service Request 5 */
#define SRC_ID_GTMTOM56			946	/* GTM TOM5 Shared Service Request 6 */
#define SRC_ID_GTMTOM57			947	/* GTM TOM5 Shared Service Request 7 */

#define SRC_ID_GTMATOM00		956	/* GTM ATOM0 Shared Service Request 0 */
#define SRC_ID_GTMATOM01		957	/* GTM ATOM0 Shared Service Request 1 */
#define SRC_ID_GTMATOM02		958	/* GTM ATOM0 Shared Service Request 2 */
#define SRC_ID_GTMATOM03		959	/* GTM ATOM0 Shared Service Request 3 */
#define SRC_ID_GTMATOM10		960	/* GTM ATOM1 Shared Service Request 0 */
#define SRC_ID_GTMATOM11		961	/* GTM ATOM1 Shared Service Request 1 */
#define SRC_ID_GTMATOM12		962	/* GTM ATOM1 Shared Service Request 2 */
#define SRC_ID_GTMATOM13		963	/* GTM ATOM1 Shared Service Request 3 */
#define SRC_ID_GTMATOM20		964	/* GTM ATOM2 Shared Service Request 0 */
#define SRC_ID_GTMATOM21		965	/* GTM ATOM2 Shared Service Request 1 */
#define SRC_ID_GTMATOM22		966	/* GTM ATOM2 Shared Service Request 2 */
#define SRC_ID_GTMATOM23		967	/* GTM ATOM2 Shared Service Request 3 */
#define SRC_ID_GTMATOM30		968	/* GTM ATOM3 Shared Service Request 0 */
#define SRC_ID_GTMATOM31		969	/* GTM ATOM3 Shared Service Request 1 */
#define SRC_ID_GTMATOM32		970	/* GTM ATOM3 Shared Service Request 2 */
#define SRC_ID_GTMATOM33		971	/* GTM ATOM3 Shared Service Request 3 */
#define SRC_ID_GTMATOM40		972	/* GTM ATOM4 Shared Service Request 0 */
#define SRC_ID_GTMATOM41		973	/* GTM ATOM4 Shared Service Request 1 */
#define SRC_ID_GTMATOM42		974	/* GTM ATOM4 Shared Service Request 2 */
#define SRC_ID_GTMATOM43		975	/* GTM ATOM4 Shared Service Request 3 */
#define SRC_ID_GTMATOM50		976	/* GTM ATOM5 Shared Service Request 0 */
#define SRC_ID_GTMATOM51		977	/* GTM ATOM5 Shared Service Request 1 */
#define SRC_ID_GTMATOM52		978	/* GTM ATOM5 Shared Service Request 2 */
#define SRC_ID_GTMATOM53		979	/* GTM ATOM5 Shared Service Request 3 */
#define SRC_ID_GTMATOM60		980	/* GTM ATOM6 Shared Service Request 0 */
#define SRC_ID_GTMATOM61		981	/* GTM ATOM6 Shared Service Request 1 */
#define SRC_ID_GTMATOM62		982	/* GTM ATOM6 Shared Service Request 2 */
#define SRC_ID_GTMATOM63		983	/* GTM ATOM6 Shared Service Request 3 */
#define SRC_ID_GTMATOM70		984	/* GTM ATOM7 Shared Service Request 0 */
#define SRC_ID_GTMATOM71		985	/* GTM ATOM7 Shared Service Request 1 */
#define SRC_ID_GTMATOM72		986	/* GTM ATOM7 Shared Service Request 2 */
#define SRC_ID_GTMATOM73		987	/* GTM ATOM7 Shared Service Request 3 */
#define SRC_ID_GTMATOM80		988	/* GTM ATOM8 Shared Service Request 0 */
#define SRC_ID_GTMATOM81		989	/* GTM ATOM8 Shared Service Request 1 */
#define SRC_ID_GTMATOM82		990	/* GTM ATOM8 Shared Service Request 2 */
#define SRC_ID_GTMATOM83		991	/* GTM ATOM8 Shared Service Request 3 */
#define SRC_ID_GTMATOM90		992	/* GTM ATOM9 Shared Service Request 0 */
#define SRC_ID_GTMATOM91		993	/* GTM ATOM9 Shared Service Request 1 */
#define SRC_ID_GTMATOM92		994	/* GTM ATOM9 Shared Service Request 2 */
#define SRC_ID_GTMATOM93		995	/* GTM ATOM9 Shared Service Request 3 */
#define SRC_ID_GTMATOM100		996	/* GTM ATOM10 Shared Service Request 0 */
#define SRC_ID_GTMATOM101		997	/* GTM ATOM10 Shared Service Request 1 */
#define SRC_ID_GTMATOM102		998	/* GTM ATOM10 Shared Service Request 2 */
#define SRC_ID_GTMATOM103		999	/* GTM ATOM10 Shared Service Request 3 */
#define SRC_ID_GTMATOM110		1000	/* GTM ATOM11 Shared Service Request 0 */
#define SRC_ID_GTMATOM111		1001	/* GTM ATOM11 Shared Service Request 1 */
#define SRC_ID_GTMATOM112		1002	/* GTM ATOM11 Shared Service Request 2 */
#define SRC_ID_GTMATOM113		1003	/* GTM ATOM11 Shared Service Request 3 */

#define SRC_ID_GTMMCSW0			1012	/* GTM Multi Channel Sequencer Service Request 0 */
#define SRC_ID_GTMMCSW1			1013	/* GTM Multi Channel Sequencer Service Request 1 */
#define SRC_ID_GTMMCSW2			1014	/* GTM Multi Channel Sequencer Service Request 2 */
#define SRC_ID_GTMMCSW3			1015	/* GTM Multi Channel Sequencer Service Request 3 */
#define SRC_ID_GTMMCSW4			1016	/* GTM Multi Channel Sequencer Service Request 4 */
#define SRC_ID_GTMMCSW5			1017	/* GTM Multi Channel Sequencer Service Request 5 */
#define SRC_ID_GTMMCSW6			1018	/* GTM Multi Channel Sequencer Service Request 6 */
#define SRC_ID_GTMMCSW7			1019	/* GTM Multi Channel Sequencer Service Request 7 */
#define SRC_ID_GTMMCSW8			1020	/* GTM Multi Channel Sequencer Service Request 8 */
#define SRC_ID_GTMMCSW9			1021	/* GTM Multi Channel Sequencer Service Request 9 */

#define IRQ_ID_MAX_NUM			1022


#endif /* __INTIDS_TC39XB_H__ */
